quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
		//--------------------------LED指示灯
		ampsys.CommLed.flag.rf_rx	=	1;
		ampsys.CommLed.time.rf_rx	=	ampledtime;
	}
}
//------------------------------------------------------------------------------


//--------------------------------static-port_data_process
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void pc_receive_data_process(void)
{  
	unsigned char		cmd	=	ampCmdNone;
	unsigned short 	rxnum=0;
	unsigned char 	rxd[maxFramesize];
	
	ampphydef* frame;
	//============================数据接收
	rxnum	=	api_usart_receive(ampCommPcPort,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	//============================接收处理
	if(0!=rxnum)
	{
		frame	=	api_get_frame(rxd,rxnum);		
		//--------------------------完整帧
		if(0!=frame)
		{
			//------------------------LED指示灯
			ampsys.CommLed.flag.pc_rx	=	1;
			ampsys.CommLed.time.pc_rx	=	ampledtime;
			
			cmd	=	frame->msg.cmd.cmd;
			//------------------------应答帧
			if(ampCmdAck==cmd)	//应答，删除一缓存
			{
				//----------------------应答
				unsigned char wait_ack	=	get_ack_wait_flag(PcPort);
				if(wait_ack)	//等待应答状态:接收到应答后需要删除最小号缓存
				{
					ampsys.Pc.SendWaitTime	=	5;
					del_cache_data(PcPort);
				}
			}
			//------------------------非应答帧
			else
			{
				//----------------------广播消息:本柜处理和转发到其它柜
				if(0xFF==frame->msg.addr.address1)
				{
					set_cache_data(CabPort,frame);		//发往其它柜
					set_cache_data(LayPort,frame);		//发往本柜层板
					cmd_process(frame);								//本柜相关命令处理
				}
				//----------------------本柜消息:本柜处理
				else if(ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)
				{
					set_cache_data(LayPort,frame);		//发往本柜层板
					cmd_process(frame);								//本柜相关命令处理
					//set_ackup_frame(PcPort);					//向上级应答
				}
				//----------------------其它柜消息:转发
				else
				{
					set_cache_data(CabPort,frame);		//发往其它柜
					//set_ackup_frame(PcPort);					//向上级应答
				}
			}
		}
		
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void pc_send_data_process(void)
{
	unsigned short sendnum=0;
	ampCachedef*	Cache;
	
	//============================等待发送时间已到
	if(0==ampsys.Pc.SendWaitTime)
	{
		//--------------------------检查有无应答数据要发送：应答数据优先发送
		if(ampsys.Pc.AckFrame.flag)
		{
			unsigned char* addr	=	&ampsys.Pc.AckFrame.head;
			sendnum	=	api_usart_send(ampCommPcPort,addr,ampAckSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
			if(sendnum)	//已将数据转移到缓存
			{	
				ampsys.Pc.AckFrame.flag	=	0;
				ampsys.Pc.SendWaitTime	=	2;
			}
			else
			{
				ampsys.Pc.SendWaitTime	=	3;	//测试
			}
		}		
		//--------------------------发送数据：清除超出发送次数的缓存，上报连接超时；广播数据只发固定再次
		else
		{
			//------------------------上报PC只发一次
			if(ampsys.Pc.ReSendCount>=1)
			{
				del_cache_data(PcPort);
			}
			//------------------------检查缓存有无需要上传的数据
			Cache	=	get_cache_data(PcPort);
			if(0==Cache)	//无数据
			{

			}
			//------------------------
			else
			{
				sendnum	=	api_usart_send(ampCommPcPort,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
				if(sendnum)	//已将数据转移到缓存
				{	
					//set_ack_wait_flag(PcPort);
					ampsys.Pc.ReSendCount+=1;			
					ampsys.Pc.SendWaitTime	=	ampReSendTime;					
					//--------------------LED指示灯
					ampsys.CommLed.flag.pc_tx	=	1;
					ampsys.CommLed.time.pc_tx	=	ampledtime;
				}
			}
		}
	}
}
//------------------------------------------------------------------------------

/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void cab_receive_data_process(void)
{  
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
//	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
//	unsigned short	Saved_len	=	0;	
	unsigned short 	rxnum=0;
	
	ampphydef* frame;
	unsigned char 	rxd[maxFramesize];
	//============================数据接收
	rxnum	=	api_rs485_receive(&ampRS485Cb,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	//============================接收处理
	if(0!=rxnum)
	{
		ampsys.Cab.SendWaitTime	=	0;
		frame	=	api_get_frame(rxd,rxnum);
		if(0!=frame)
		{
			//--------------------------LED指示灯
			ampsys.CommLed.flag.cb_rx	=	1;
			ampsys.CommLed.time.cb_rx	=	ampledtime;
			
			cmd	=	frame->msg.cmd.cmd;
			dir	=	frame->msg.cmd.dir;
			//--------------------------检查是否为应答
			if(ampCmdAck==cmd)					//应答，删除一缓存
			{	
				//------------------------应答
				unsigned char wait_ack	=	get_ack_wait_flag(CabPort);
				if(wait_ack)
				{
					if(1==dir)	//上传
					{
						if(ampsys.sysdata.MB_Flag)		//主柜
						{
							del_cache_data(CabPort);
						}
					}
					else			//向下
					{
						if(0==ampsys.sysdata.MB_Flag)		//辅柜
						{							
							del_cache_data(CabPort);
						}
					}
				}
			}
			//--------------------------通讯数据
			else
			{
				if(1==dir)	//上传
				{
					//----------------------主柜数据转发到PC
					if(ampsys.sysdata.MB_Flag)	//主柜
					{
						set_cache_data(PcPort,frame);			//发往PC缓存
						set_ackdown_frame(CabPort);
					}
				}
				else
				{
					//----------------------广播
					if(0xFF==frame->msg.addr.address1)
					{
						set_cache_data(LayPort,frame);
						cmd_process(frame);
					}
					//----------------------本柜
					else if(ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)
					{
						//--------------------轮询消息
						if(ampCmdCheckSleve==frame->msg.cmd.cmd)
						{
							ampCachedef*	Cache	=	get_cache_data(CabPort);
							//------------------无待传数据：应答
							if(0==Cache)
							{
								set_ackup_frame(CabPort);
							}
							else
							{
								ampsys.Cab.SlaveSendEnable	=	1;
							}
						}
						//--------------------其它消息
						else
						{
							set_cache_data(LayPort,frame);
							cmd_process(frame);
							set_ackup_frame(CabPort);
						}					
					}
				}
			}		
		}
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cab_send_data_process(void)
{	
	unsigned short sendnum=0;
	ampCachedef*	Cache	=	get_cache_data(CabPort);
	ampphydef* frame;
	
	//============================检查应答消息:立即应答
	if(ampsys.Cab.AckFrame.flag)
	{
		unsigned char* addr	=	&ampsys.Cab.AckFrame.head;
		sendnum	=	api_rs485_send_force(&ampRS485Cb,addr,ampAckSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.Cab.AckFrame.flag	=	0;
			ampsys.Cab.SendWaitTime		=	ampReSendTime;
		}
	}
	//============================缓存有数据待发送:主机立即发送，从机如果允许发送也立即发送
	else if((0!=Cache)&&(((0!=ampsys.sysdata.MB_Flag)&&(0==ampsys.Cab.SendWaitTime))|(0!=ampsys.Cab.SlaveSendEnable)))
	{
		//------------------------检查有无超出重发次数
		if(ampsys.Cab.ReSendCount>=ampMaxResendCount)
		{
			frame	=	(ampphydef*)Cache->data;
			if(ampsys.sysdata.MB_Flag)	//主柜
			{
				set_comm_time_out_frame(PcPort,frame);
			}
			else
			{
				set_comm_time_out_frame(CabPort,frame);
			}
			del_cache_data(CabPort);
		}
		//------------------------发送数据
		else
		{				
			sendnum	=	api_rs485_send_force(&ampRS485Cb,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
			//----------------------已将数据转移到缓存
			if(sendnum)
			{						
				ampsys.Cab.ReSendCount			+=1;			
				ampsys.Cab.SendWaitTime			=	ampReSendTime;
				
