quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
		//------透明屏标志
		if(id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
		unsigned char new_id  = 0;
		new_id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id != new_id)  //重新初始化
		{
			ampsys.sysdata.Cab_Addr	=	new_id&0x3F;	

			if(new_id&0x80)
				ampsys.sysdata.MB_Flag	=	1;
			else
				ampsys.sysdata.MB_Flag	=	0;
			//------透明屏标志
		if(new_id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		
//			power_on_flag = 0;
			id = new_id;
		}
		
  }
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lock_server(void)
{
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		if(ampGetLockSts)			//锁未打开
		{
			ampUnLock;
			ampsys.Lock.LockTime=ampUnlockOuttime;
		}
		else
		{
			if(ampsys.Lock.LockTime>0)
			{
				ampsys.Lock.LockTime--;
			}
			else
			{
				ampResLock;
			}
		}
	}
	//==========================正常驱动
	else
	{
		if(ampsys.Lock.LockTime>0)
		{
			if(ampsys.Lock.LockTime<ampUnlockOuttime-100)
			{
				if(ampGetLockSts)			//锁未打开
				{
					ampUnLock;
				}
				else if(ampsys.Lock.LockTime>200)
				{
					ampsys.Lock.LockTime	=	200-1;	//延迟500ms释放锁
				}
			}
			else
			{
				ampUnLock;
			}
		}
		//============================
		else
		{
			ampResLock;
			//--------------------------门状态--关闭
			if(ampGetLockSts)
			{
				if(0==ampsys.Lock.flag.LockStatus)	//原来为开门状态
				{
					set_layer_power(0);				//关层板电源
					set_lock_status_frame();	//上报关门消息
					ampsys.Lock.flag.LockUpdata	=	1;
				}
				else
				{
					ampsys.Lock.flag.LockUpdata	=	0;
				}			
				ampsys.Lock.flag.LockStatus	=	1;
			}
			//--------------------------门状态--打开
			else
			{
				if(0!=ampsys.Lock.flag.LockStatus)	//原来为关门状态
				{
					set_lock_status_frame();
					ampsys.Lock.flag.LockUpdata	=	1;
				}
				else
				{
					ampsys.Lock.flag.LockUpdata	=	0;
				}
				ampsys.Lock.flag.LockStatus	=	0;
			}		
		}
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	Magnetic_Lock_server
*功能描述		:	磁吸锁
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Magnetic_Lock_server(void)
{
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		ampMagneticOff;
		//ampsys.MagneticLock.LockTime=0;
	}
	//==========================锁状态有变化
	else if(ampsys.Lock.flag.LockUpdata)
	{
		//------------------------开门:释放磁吸锁	
		if(1==ampsys.Lock.flag.LockStatus)
		{
			ampMagneticOn;
		}
		else
		{			
			ampMagneticOff;
		}
	}
	//==========================等待一定时间后释放锁

}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void CommLed_Server(void)
{
	unsigned char displaycode	=	0;
  static unsigned short freshen_led_time=0;
	//==========================
	if(ampsys.CommLed.FlashTime++>100)
	{
		ampsys.CommLed.FlashTime=0;
		//------------------------需要点亮
		if(0==ampsys.CommLed.ClearFlag)
		{
			ampsys.CommLed.ClearFlag=1;
			
			ampsys.CommLed.displaycode.code	=	0;
			//----------------------读卡器
			if(ampsys.CommLed.time.rf_rx>0)
			{
				ampsys.CommLed.time.rf_rx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.rf_rx	=	1;
			}
			if(ampsys.CommLed.time.rf_tx>0)
			{
				ampsys.CommLed.time.rf_tx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.rf_tx	=	1;
			}
			//----------------------层接口
			if(ampsys.CommLed.time.ly_rx>0)
			{
				ampsys.CommLed.time.ly_rx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.ly_rx	=	1;;
			}
			if(ampsys.CommLed.time.ly_tx>0)
			{
				ampsys.CommLed.time.ly_tx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.ly_tx	=	1;
			}
			//----------------------柜接口
			if(ampsys.CommLed.time.cb_rx>0)
			{
				ampsys.CommLed.time.cb_rx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.cb_rx	=	1;
			}
			if(ampsys.CommLed.time.cb_tx>0)
			{
				ampsys.CommLed.time.cb_tx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.cb_tx	=	1;
			}
			//----------------------PC接口
			if(ampsys.CommLed.time.pc_rx>0)
			{
				ampsys.CommLed.time.pc_rx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.pc_rx	=	1;
			}
			if(ampsys.CommLed.time.pc_tx>0)
			{
				ampsys.CommLed.time.pc_tx-=1;
			}
			else
			{
				ampsys.CommLed.displaycode.flag.pc_tx	=	1;
			}			
			displaycode	=	ampsys.CommLed.displaycode.code;
		}
		else
		{
			ampsys.CommLed.ClearFlag=0;
			displaycode	=	0xFF;
		}
		//========================发送数据
		spi_set_nss_low(&stLed);
		SPI_I2S_SendData(stLed.port.SPIx, displaycode);				//发送数据
		spi_set_nss_high(&stLed);
	}	
	return ;
	
	
	
	
	
  if(freshen_led_time++>100)
  {
		freshen_led_time	=	0;
		
		displaycode	=	ampsys.CommLed.display;
		displaycode	=	displaycode^0xFF;
		
		ampsys.CommLed.display	=	displaycode;
		if(ampsys.CommLed.time.rf_rx>0)
		{
			ampsys.CommLed.time.rf_rx-=1;
		}
		else
		{
			displaycode|=0x80;
		}
		if(ampsys.CommLed.time.rf_tx>0)
		{
			ampsys.CommLed.time.rf_tx-=1;
		}
		else
		{
			displaycode|=0x40;
		}
		//--------------------------------
		if(ampsys.CommLed.time.ly_rx>0)
		{
			ampsys.CommLed.time.ly_rx-=1;
		}
		else
		{
			displaycode|=0x20;
		}
		if(ampsys.CommLed.time.ly_tx>0)
		{
			ampsys.CommLed.time.ly_tx-=1;
		}
		else
		{
			displaycode|=0x10;
		}
		//--------------------------------
		if(ampsys.CommLed.time.cb_rx>0)
		{
			ampsys.CommLed.time.cb_rx-=1;
		}
		else
		{
			displaycode|=0x08;
		}
		if(ampsys.CommLed.time.cb_tx>0)
		{
			ampsys.CommLed.time.cb_tx-=1;
		}
		else
		{
			displaycode|=0x04;
		}
		//--------------------------------
		if(ampsys.CommLed.time.pc_rx>0)
		{
			ampsys.CommLed.time.pc_rx-=1;
		}
		else
		{
			displaycode|=0x02;
		}
		if(ampsys.CommLed.time.pc_tx>0)
		{
			ampsys.CommLed.time.pc_tx-=1;
		}
		else
		{
			displaycode|=0x01;
		}
		
