quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
		//____________使能片选
		spi_set_nss_low(&stLed);
		SPI_I2S_SendData(stLed.port.SPIx, displaycode);				//发送数据
//    SPI_ReadWriteByteSPI(&stLed,led_stata);
		//____________取消片选	
		spi_set_nss_high(&stLed);
  }  
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Server(void)
{
	//#define ampBackLightOff		PWM_OUT(TIM3,PWM_OUTChannel3,500,10)	//PWM设定-20161127版本	占空比1/1000
	//#define ampBackLightOn		PWM_OUT(TIM3,PWM_OUTChannel3,500,990)	//PWM设定-20161127版本	占空比1/1000
	//ampsys.Lock.flag.LockStatus
	//ampsys.Lock.flag.LockUpdata
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		ampsys.BackLight.Time++;
		if(ampsys.BackLight.Time==500)	//亮
		{
			ampBackLighSet(900);
		}
		else if(ampsys.BackLight.Time>=1000)	//暗
		{
			ampsys.BackLight.Time	=	0;
			ampBackLighSet(100);
		}
		ampsys.BackLight.flag.WorkLevel=0;
		ampsys.BackLight.flag.SetLevel =0;
	}
	//==========================门状态改变
	else if(ampsys.Lock.flag.LockUpdata)
	{
		//------------------------开门:保持中等亮度		
		if(0==ampsys.Lock.flag.LockStatus)
		{
			if(2!=ampsys.BackLight.flag.WorkLevel)
			{
				ampBackLighSet(300);
				ampsys.BackLight.flag.WorkLevel	=	2;
				ampsys.BackLight.Time						=	0;
			}			
		}
		//------------------------关门:先高亮后低亮
		else
		{
			if(3!=ampsys.BackLight.flag.WorkLevel)
			{
				ampBackLighSet(999);
				ampsys.BackLight.flag.WorkLevel	=	3;
			}
			ampsys.BackLight.Time							=	BackLightOnTime;
		}
	}
	//==========================控制命令或者计时器
	else
	{
		//------------------------最低亮度/灭灯，计时或者需要灭灯时请求，开门时LCD背光亮度
		if(1==ampsys.BackLight.flag.SetLevel)
		{
			if(1!=ampsys.BackLight.flag.WorkLevel)
			{
				ampBackLighSet(1);
				ampsys.BackLight.flag.WorkLevel	=	1;				
			}
			ampsys.BackLight.Time						=	0;
		}
		//------------------------中等亮度，开门时柜体背光亮度
		else if(2==ampsys.BackLight.flag.SetLevel)
		{
			if(2!=ampsys.BackLight.flag.WorkLevel)
			{
				ampBackLighSet(500);
				ampsys.BackLight.flag.WorkLevel		=	2;				
			}
			ampsys.BackLight.Time							=	BackLightOnTime;
		}
		//------------------------最高亮度，关门时需要亮灯时的亮度
		else if(3==ampsys.BackLight.flag.SetLevel)
		{
			if(3!=ampsys.BackLight.flag.WorkLevel)
			{
				ampBackLighSet(999);
				ampsys.BackLight.flag.WorkLevel		=	3;				
			}
			ampsys.BackLight.Time							=	BackLightOnTime;
		}
		else
		{
			//----------------------倒计时
			if(ampsys.BackLight.Time)
			{
				ampsys.BackLight.Time--;
			}
			else
			{
				//--------------------门已打开
				if(0==ampsys.Lock.flag.LockStatus)
				{
					//------------------中等亮度
					if(2!=ampsys.BackLight.flag.WorkLevel)
					{
						ampBackLighSet(500);
						ampsys.BackLight.flag.WorkLevel		=	2;
					}
				}
				else
				{
					//------------------最低亮度/灭灯，计时或者需要灭灯时请求，开门时LCD背光亮度
					if(1!=ampsys.BackLight.flag.WorkLevel)
					{					
						ampBackLighSet(100);
						ampsys.BackLight.flag.WorkLevel		=	1;
					}
				}
			}
		}
		ampsys.BackLight.flag.SetLevel		=	0;
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void LcdLight_Server(void)
{
	//#define ampLcdLightOff	PWM_OUTN(TIM1,PWM_OUTChannel2,500,1000)	//PWM设定-20161127版本	占空比1/1000
	//#define ampLcdLightOn		PWM_OUTN(TIM1,PWM_OUTChannel2,500,0)		//PWM设定-20161127版本	占空比1/1000
	//ampsys.Lock.flag.LockStatus
	//ampsys.Lock.flag.LockUpdata
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		ampsys.LcdLight.Time++;
		if(ampsys.LcdLight.Time==500)
		{
			ampLcdLightSet(100);
		}
		else if(ampsys.LcdLight.Time>=1000)
		{
			ampsys.LcdLight.Time	=	0;
			ampLcdLightSet(900);
		}
		ampsys.LcdLight.flag.WorkLevel=0;
		ampsys.LcdLight.flag.SetLevel =0;
	}
	//==========================门状态改变
	else if(ampsys.Lock.flag.LockUpdata)
	{
		//------------------------开门:灭灯
		if(0==ampsys.Lock.flag.LockStatus)
		{
			if(1!=ampsys.LcdLight.flag.WorkLevel)
			{
				ampLcdLightSet(0);
				ampsys.LcdLight.flag.WorkLevel	=	1;
				ampsys.LcdLight.Time						=	0;
			}
		}
		//------------------------关门:先高亮后灭灯
		else
		{
			if(3!=ampsys.LcdLight.flag.WorkLevel)
			{
				ampLcdLightSet(900);
				ampsys.LcdLight.flag.WorkLevel		=	3;
			}			
			ampsys.LcdLight.Time							=	LcdLightOnTime;
		}
	}
	//==========================控制命令或者计时器
	else
	{		
		//------------------------最低亮度/灭灯，计时或者需要灭灯时请求，开门时LCD背光亮度
		if(1==ampsys.LcdLight.flag.SetLevel)
		{
			if(1!=ampsys.LcdLight.flag.WorkLevel)
			{
				ampLcdLightSet(100);
				ampsys.LcdLight.flag.WorkLevel	=	1;
			}
			ampsys.LcdLight.Time						=	0;
		}
		//------------------------中等亮度，开门时柜体背光亮度
		else if(2==ampsys.LcdLight.flag.SetLevel)
		{
			if(2!=ampsys.LcdLight.flag.WorkLevel)
			{
				ampLcdLightSet(500);
				ampsys.LcdLight.flag.WorkLevel		=	2;
			}
			ampsys.LcdLight.Time							=	LcdLightOnTime;
		}
		//------------------------最高亮度，关门时需要亮灯时的亮度
		else if(3==ampsys.LcdLight.flag.SetLevel)
		{
			if(3!=ampsys.LcdLight.flag.WorkLevel)
			{
				ampLcdLightSet(900);
				ampsys.LcdLight.flag.WorkLevel		=	3;
			}
			ampsys.LcdLight.Time							=	LcdLightOnTime;
		}
		//------------------------计时器
		else
		{
			//----------------------倒计时
			if(ampsys.LcdLight.Time)
			{
				ampsys.LcdLight.Time--;
			}
			//----------------------
			else
			{
				//--------------------最低亮度
				if(1!=ampsys.LcdLight.flag.WorkLevel)
				{
					ampLcdLightSet(0);
					//PWM_OUTTim1CH2N_Set_Ratio(1);
					ampsys.LcdLight.flag.WorkLevel		=	1;
				}
			}
		}
		ampsys.LcdLight.flag.SetLevel	=	0;
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Tim_Server(void)
{
  //----------------PC发送
  if(ampsys.Pc.SendWaitTime>0)
  {
    ampsys.Pc.SendWaitTime--;
  }
  //----------------柜发送
  if(ampsys.Cab.SendWaitTime>0)
  {
    ampsys.Cab.SendWaitTime--;
  }
  //----------------层发送
  if(ampsys.Lay.SendWaitTime>0)
  {
    ampsys.Lay.SendWaitTime--;
  }
  //----------------读卡器发送
  if(ampsys.time.CardSendTime>0)
  {
    ampsys.time.CardSendTime--;
  }
  //----------------锁
  if(ampsys.Lock.LockTime>0)
  {
    ampsys.Lock.LockTime--;
  }
  //----------------拨码
  if(ampsys.time.swicthidtime>0)
  {
    ampsys.time.swicthidtime--;
  }
  //----------------运行指示灯
  if(ampsys.time.SYSLEDTime>0)
  {
    ampsys.time.SYSLEDTime--;
  }
	//----------------层板供电等待时间
  if(ampsys.time.LayPowerOnTime>0)
  {
    ampsys.time.LayPowerOnTime--;
		if(0==ampsys.time.LayPowerOnTime)
		{
			ampsys.sysdata.LayPowerOnFlag	=	1;
		}
  }
}
//------------------------------------------------------------------------------







//--------------------------------static-configuration
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Hardware_Configuration(void)
{
  BackLight_Configuration();
	LayPower_Configuration();
	Lock_Configuration();
  SwitchID_Configuration();
  Led_Configuration();
  Communication_Configuration();
	GPIO_Configuration_OPP50(ampSYSLEDPort,ampSYSLEDPin);
}
//------------------------------------------------------------------------------

